# Default English localization settings
Font.default_name = Language::FONT_WESTERN

class Language
  def self.create_input
	if Font.default_name == FONT_J
	  input = Window_NameInput.new
      input.ok_text = '決定'
      input.set_mode_buttons [['英字', 'かな', 'カナ']]
      input.character_tables = {
        [0] => [ # Latin
          "A","B","C","D","E","F","G","H","I","a","b","c","d","e","f","g","h","i",
          "J","K","L","M","N","O","P","Q","R","j","k","l","m","n","o","p","q","r",
          "S","T","U","V","W","X","Y","Z"," ","s","t","u","v","w","x","y","z"," ",
          "0","1","2","3","4","+","-","=","&","!","?","'",'"',".",",",":",";","$",
          "5","6","7","8","9","*","/","#","|","[","]","(",")","<",">","{","}","@",
        ],
        [1] => [ # Hiragana
          "ー","っ","ぁ","ぱ","ば","だ","ざ","が","わ","ら","や","ま","は","な","た","さ","か","あ",
          "～","ゃ","ぃ","ぴ","び","ぢ","じ","ぎ"," ","り"," ","み","ひ","に","ち","し","き","い",
          "・","ゅ","ぅ","ぷ","ぶ","づ","ず","ぐ","を","る","ゆ","む","ふ","ぬ","つ","す","く","う",
          "＝","ょ","ぇ","ぺ","べ","で","ぜ","げ"," ","れ"," ","め","へ","ね","て","せ","け","え",
          "☆","ゎ","ぉ","ぽ","ぼ","ど","ぞ","ご","ん","ろ","よ","も","ほ","の","と","そ","こ","お",
        ],
        [2] => [ # Katakana
          "ー","ッ","ァ","パ","バ","ダ","ザ","ガ","ワ","ラ","ヤ","マ","ハ","ナ","タ","サ","カ","ア",
          "～","ャ","ィ","ピ","ビ","ヂ","ジ","ギ"," ","リ"," ","ミ","ヒ","ニ","チ","シ","キ","イ",
          "・","ュ","ゥ","プ","ブ","ヅ","ズ","グ","ヲ","ル","ユ","ム","フ","ヌ","ツ","ス","ク","ウ",
          "＝","ョ","ェ","ペ","ベ","デ","ゼ","ゲ"," ","レ"," ","メ","ヘ","ネ","テ","セ","ケ","エ",
          "☆","ヮ","ォ","ポ","ボ","ド","ゾ","ゴ","ン","ロ","ヨ","モ","ホ","ノ","ト","ソ","コ","オ",
        ],
      }
      input.index = 17 # Start on あ
      input.table_height = 5
      input.init
	elsif $persistent.langcode == 'ru'
      input = Window_NameInput.new
      input.ok_text = 'ОК'
    input.set_mode_buttons [[tr('Англ.'), tr('Рус.')]]
      input.character_tables = {
        [0] => [ # Latin
        "A","B","C","D","E","F","G","H","I","a","b","c","d","e","f","g","h","i",
        "J","K","L","M","N","O","P","Q","R","j","k","l","m","n","o","p","q","r",
        "S","T","U","V","W","X","Y","Z"," ","s","t","u","v","w","x","y","z"," ",
        "0","1","2","3","4","+","-","=","&","!","?","'",'"',".",",",":",";","$",
        "5","6","7","8","9","*","/","#","|","[","]","(",")","<",">","{","}","@",
      ],
      [1] => [ # Cyrillic
        "А","Б","В","Г","Д","Е","Ё","Ж","З","а","б","в","г","д","е","ё","ж","з",
        "И","Й","К","Л","М","Н","О","П","Р","и","й","к","л","м","н","о","п","р",
        "С","Т","У","Ф","Х","Ц","Ч","Ш"," ","с","т","у","ф","х","ц","ч","ш"," ",
        "Щ","Ъ","Ы","Ь","Э","Ю","Я","♥","♦","щ","ъ","ы","ь","э","ю","я","♣","♠",
        "☼","%","~","^","€","§","\\","№","©","®","™","♪","♫","▲","■","«","»","¿",
        ],
      }
      input.table_height = 5
      input.init
	else
	  input = Window_NameInput.new
	  input.set_mode_buttons [[tr('Upper'), tr('Lower')]]
	  input.character_tables = {
	    [0] => [ # Case: Upper
	  	"A","B","C","D","E","F","G","H","I","J",
	  	"K","L","M","N","O","P","Q","R","S","T",
		"U","V","W","X","Y","Z"," ",".",",","-",
		"0","1","2","3","4","5","6","7","8","9",
		"!","?",'"',"'","/","&","[","]","(",")",
	    ],
	    [1] => [ # Case: Lower
		"a","b","c","d","e","f","g","h","i","j",
		"k","l","m","n","o","p","q","r","s","t",
		"u","v","w","x","y","z"," ",".",",","-",
		"0","1","2","3","4","5","6","7","8","9",
		"!","?",'"',"'","/","&","[","]","(",")",
	    ],
	  }
	  input.table_height = 5
	  input.init
	end
  end
end
