Font.default_name = Language::FONT_J

class Language
  def self.create_input
    input = Window_NameInput.new
    input.ok_text = '決定'
    input.set_mode_buttons [['かな', 'カナ', '英字']]
    input.character_tables = {
      [0] => [ # Hiragana
        "ー","っ","ぁ","ぱ","ば","だ","ざ","が","わ","ら","や","ま","は","な","た","さ","か","あ",
        "～","ゃ","ぃ","ぴ","び","ぢ","じ","ぎ"," ","り"," ","み","ひ","に","ち","し","き","い",
        "・","ゅ","ぅ","ぷ","ぶ","づ","ず","ぐ","を","る","ゆ","む","ふ","ぬ","つ","す","く","う",
        "＝","ょ","ぇ","ぺ","べ","で","ぜ","げ"," ","れ"," ","め","へ","ね","て","せ","け","え",
        "☆","ゎ","ぉ","ぽ","ぼ","ど","ぞ","ご","ん","ろ","よ","も","ほ","の","と","そ","こ","お",
      ],
      [1] => [ # Katakana
        "ー","ッ","ァ","パ","バ","ダ","ザ","ガ","ワ","ラ","ヤ","マ","ハ","ナ","タ","サ","カ","ア",
        "～","ャ","ィ","ピ","ビ","ヂ","ジ","ギ"," ","リ"," ","ミ","ヒ","ニ","チ","シ","キ","イ",
        "・","ュ","ゥ","プ","ブ","ヅ","ズ","グ","ヲ","ル","ユ","ム","フ","ヌ","ツ","ス","ク","ウ",
        "＝","ョ","ェ","ペ","ベ","デ","ゼ","ゲ"," ","レ"," ","メ","ヘ","ネ","テ","セ","ケ","エ",
        "☆","ヮ","ォ","ポ","ボ","ド","ゾ","ゴ","ン","ロ","ヨ","モ","ホ","ノ","ト","ソ","コ","オ",
      ],
      [2] => [ # Latin
        "A","B","C","D","E","F","G","H","I","a","b","c","d","e","f","g","h","i",
        "J","K","L","M","N","O","P","Q","R","j","k","l","m","n","o","p","q","r",
        "S","T","U","V","W","X","Y","Z"," ","s","t","u","v","w","x","y","z"," ",
        "0","1","2","3","4","+","-","=","&","!","?","'",'"',".",",",":",";","$",
        "5","6","7","8","9","*","/","#","|","[","]","(",")","<",">","{","}","@",
      ],
    }
    input.index = 17 # Start on あ
    input.table_height = 5
    input.init
  end
end
